app/controllers/notes_controller.rb

    def index
        notes = Note.all
---
SELECT "notes".* FROM "notes"

    def show
        note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        note = Note.create(note_params)
---
INSERT INTO "notes" ("user_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["title", "Title"], ["body", "Body"], ["created_at", "2020-01-02 16:26:41.344346"], ["updated_at", "2020-01-02 16:26:41.344346"]]

    def destroy
        note = Note.find(params[:id])
        note.delete()
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]

    def update
        note = Note.find(params[:id])
        newNote = note.update!(note_params)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
UPDATE "notes" SET "body" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["body", "Bosyyy"], ["updated_at", "2020-01-03 03:53:16.196569"], ["id", 24]]