app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "user3"], ["created_at", "2019-12-31 15:04:11.334257"], ["updated_at", "2019-12-31 15:04:11.334257"]]
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "user2"], ["LIMIT", 1]]
---
    def show
        user = User.find_or_create_by(params[:username])